In [2]:
#------------------------Page Five----------------------------
import pandas as pd
import numpy as np

In [3]:
#-----------------------Joins----------------------------#
#-------Inner Join------
# Merge
df1 = pd.DataFrame({'id':['A','B','C','D'],
                    'age':[21,22,23,24]})
df2 = pd.DataFrame({'id':['C','D','E','F'],
                    'job':['Doctor','Accountant','Developer','Teacher']})

In [7]:
print(df1)
print(df2)

  id  age
0  A   21
1  B   22
2  C   23
3  D   24
  id         job
0  C      Doctor
1  D  Accountant
2  E   Developer
3  F     Teacher

In [8]:
# Inner Join - Example one
df_inner_join = df1.merge(df2, on='id',how='inner')

print(df_inner_join)

  id  age         job
0  C   23      Doctor
1  D   24  Accountant

In [6]:
# shape
print(df1.shape)
print(df2.shape)
print(df_inner_join.shape)

(4, 2)
(4, 2)
(2, 3)

In [9]:
df_movies = pd.read_csv('../Assets/IMDb movies.csv')
df_ratings = pd.read_csv('../Assets/IMDb ratings.csv')

In [10]:
df_movies = df_movies[['imdb_title_id', 'title', 'year', 'genre', 'country']]
df_ratings = df_ratings[['imdb_title_id', 'total_votes', 'mean_vote']]

In [14]:
# Example Two
df_movies_inner = df_movies.merge(df_ratings, on='imdb_title_id', how='inner')

In [16]:
print(df_movies_inner.shape)
print(df_ratings.shape)
print(df_movies.shape)

(80424, 7)
(85855, 3)
(81273, 5)

In [17]:
df_movies_inner

,imdb_title_id,title,year,genre,country,total_votes,mean_vote
0,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,589,6.3
1,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark",188,6.0
2,tt0002101,Cleopatra,1912,"Drama, History",USA,446,5.3
3,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,2237,6.9
4,tt0002199,"From the Manger to the Cross; or, Jesus of Naz...",1912,"Biography, Drama",USA,484,5.8
...,...,...,...,...,...,...,...
80419,tt9903716,Jessie,2019,"Horror, Thriller",India,318,7.7
80420,tt9905412,Ottam,2019,Drama,India,494,7.9
80421,tt9905462,Pengalila,2019,Drama,India,553,8.5
80422,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India,265,7.8
80423,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey,194,9.4

In [18]:
# Inner join with pd.merge
pd.merge(df_movies_inner, df_movies, on='imdb_title_id', how='inner')

,imdb_title_id,title_x,year_x,genre_x,country_x,total_votes,mean_vote,title_y,year_y,genre_y,country_y
0,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,589,6.3,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia
1,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark",188,6.0,Den sorte drøm,1911,Drama,"Germany, Denmark"
2,tt0002101,Cleopatra,1912,"Drama, History",USA,446,5.3,Cleopatra,1912,"Drama, History",USA
3,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,2237,6.9,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy
4,tt0002199,"From the Manger to the Cross; or, Jesus of Naz...",1912,"Biography, Drama",USA,484,5.8,"From the Manger to the Cross; or, Jesus of Naz...",1912,"Biography, Drama",USA
...,...,...,...,...,...,...,...,...,...,...,...
80419,tt9903716,Jessie,2019,"Horror, Thriller",India,318,7.7,Jessie,2019,"Horror, Thriller",India
80420,tt9905412,Ottam,2019,Drama,India,494,7.9,Ottam,2019,Drama,India
80421,tt9905462,Pengalila,2019,Drama,India,553,8.5,Pengalila,2019,Drama,India
80422,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India,265,7.8,Padmavyuhathile Abhimanyu,2019,Drama,India
80423,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey,194,9.4,Sokagin Çocuklari,2019,"Drama, Family",Turkey

In [19]:
#----------------------Full Join-----------------------------------
df1.merge(df2,on='id',how='outer')

  id   age         job
0  A  21.0         NaN
1  B  22.0         NaN
2  C  23.0      Doctor
3  D  24.0  Accountant
4  E   NaN   Developer
5  F   NaN     Teacher

In [20]:
df_movies_outer = df_movies.merge(df_ratings,on='imdb_title_id',how='outer')

In [21]:
print(df_movies.shape)
print(df_ratings.shape)
print(df_movies_outer.shape)

(81273, 5)
(85855, 3)
(86704, 7)

In [22]:
pd.merge(df_movies,df_ratings,on='imdb_title_id',how='outer')

,imdb_title_id,title,year,genre,country,total_votes,mean_vote
0,tt0000009,NaN,NaN,NaN,NaN,154.0,5.9
1,tt0000574,The Story of the Kelly Gang,1906.0,"Biography, Crime, Drama",Australia,589.0,6.3
2,tt0001892,Den sorte drøm,1911.0,Drama,"Germany, Denmark",188.0,6.0
3,tt0002101,Cleopatra,1912.0,"Drama, History",USA,446.0,5.3
4,tt0002130,L'Inferno,1911.0,"Adventure, Drama, Fantasy",Italy,2237.0,6.9
...,...,...,...,...,...,...,...
86699,tt9908390,NaN,NaN,NaN,NaN,398.0,5.5
86700,tt9911196,NaN,NaN,NaN,NaN,724.0,7.9
86701,tt9911774,Padmavyuhathile Abhimanyu,2019.0,Drama,India,265.0,7.8
86702,tt9914286,Sokagin Çocuklari,2019.0,"Drama, Family",Turkey,194.0,9.4
86703,tt9914942,NaN,NaN,NaN,NaN,102.0,6.8

In [24]:
#-------------Exclusive Full join(show result opposite to inner join)-------------------
df1.merge(df2,on='id',how='outer',indicator=True)

  id   age         job      _merge
0  A  21.0         NaN   left_only
1  B  22.0         NaN   left_only
2  C  23.0      Doctor        both
3  D  24.0  Accountant        both
4  E   NaN   Developer  right_only
5  F   NaN     Teacher  right_only

In [26]:
# query - select left only and right only values
df1.merge(df2,on='id',how='outer',indicator=True).query("_merge=='left_only' or _merge=='right_only'")

  id   age        job      _merge
0  A  21.0        NaN   left_only
1  B  22.0        NaN   left_only
4  E   NaN  Developer  right_only
5  F   NaN    Teacher  right_only

In [27]:
df_movies_exclusive = df_movies.merge(df_ratings,on='imdb_title_id',how='outer',indicator=True)

In [28]:
df_movies_exclusive

,imdb_title_id,title,year,genre,country,total_votes,mean_vote,_merge
0,tt0000009,NaN,NaN,NaN,NaN,154.0,5.9,right_only
1,tt0000574,The Story of the Kelly Gang,1906.0,"Biography, Crime, Drama",Australia,589.0,6.3,both
2,tt0001892,Den sorte drøm,1911.0,Drama,"Germany, Denmark",188.0,6.0,both
3,tt0002101,Cleopatra,1912.0,"Drama, History",USA,446.0,5.3,both
4,tt0002130,L'Inferno,1911.0,"Adventure, Drama, Fantasy",Italy,2237.0,6.9,both
...,...,...,...,...,...,...,...,...
86699,tt9908390,NaN,NaN,NaN,NaN,398.0,5.5,right_only
86700,tt9911196,NaN,NaN,NaN,NaN,724.0,7.9,right_only
86701,tt9911774,Padmavyuhathile Abhimanyu,2019.0,Drama,India,265.0,7.8,both
86702,tt9914286,Sokagin Çocuklari,2019.0,"Drama, Family",Turkey,194.0,9.4,both
86703,tt9914942,NaN,NaN,NaN,NaN,102.0,6.8,right_only

In [29]:
pd.merge(df_movies,df_ratings,on='imdb_title_id',how='outer',indicator=True).query("_merge=='left_only' or _merge=='right_only'")

,imdb_title_id,title,year,genre,country,total_votes,mean_vote,_merge
0,tt0000009,NaN,NaN,NaN,NaN,154.0,5.9,right_only
14,tt0003102,NaN,NaN,NaN,NaN,100.0,6.3,right_only
28,tt0003952,Le faux magistrat,1914.0,"Crime, Drama",France,NaN,NaN,left_only
42,tt0004743,NaN,NaN,NaN,NaN,112.0,5.4,right_only
56,tt0005680,NaN,NaN,NaN,NaN,130.0,5.9,right_only
...,...,...,...,...,...,...,...,...
86695,tt9904802,NaN,NaN,NaN,NaN,764.0,6.4,right_only
86698,tt9906644,NaN,NaN,NaN,NaN,491.0,7.2,right_only
86699,tt9908390,NaN,NaN,NaN,NaN,398.0,5.5,right_only
86700,tt9911196,NaN,NaN,NaN,NaN,724.0,7.9,right_only
86703,tt9914942,NaN,NaN,NaN,NaN,102.0,6.8,right_only

In [30]:
#-------------------------Left Join--------------------------
df1.merge(df2,on='id',how='left')

  id  age         job
0  A   21         NaN
1  B   22         NaN
2  C   23      Doctor
3  D   24  Accountant

In [34]:
# extract 50% from df movies
df_movies_sample = df_movies.sample(frac=0.5)

In [38]:
df_left = df_movies_sample.merge(df_ratings,on='imdb_title_id',how='left')

In [40]:
df_left

,imdb_title_id,title,year,genre,country,total_votes,mean_vote
0,tt0762108,I'll Be There with You,2006,Thriller,USA,128.0,7.0
1,tt2044077,Wo kou de zong ji,2011,Action,China,525.0,5.5
2,tt3846718,Mesuvag Harig,2015,"Comedy, Horror",Israel,238.0,5.4
3,tt0048078,Five Guns West,1955,Western,USA,677.0,4.8
4,tt0022753,Chandu the Magician,1932,"Action, Adventure, Comedy",USA,869.0,6.4
...,...,...,...,...,...,...,...
40631,tt0052711,"Crime & Punishment, USA",1959,Drama,USA,149.0,6.1
40632,tt0315431,Constellation,2005,Drama,USA,538.0,4.7
40633,tt3006156,Tteu-geoun ann-yeong,2013,"Comedy, Drama",South Korea,191.0,7.1
40634,tt0068416,Cosa avete fatto a Solange?,1972,"Horror, Mystery, Thriller","Italy, West Germany, UK",4291.0,7.0
40635,tt6359956,A Bad Moms Christmas,2017,Comedy,"USA, China",40110.0,5.7

In [39]:
print(df_movies_sample.shape)
print(df_movies.shape)
print(df_ratings.shape)
print(df_left.shape)

(40636, 5)
(81273, 5)
(85855, 3)
(40636, 7)

In [37]:
pd.merge(df_movies_sample,df_ratings,on='imdb_title_id',how='left')

,imdb_title_id,title,year,genre,country,total_votes,mean_vote
0,tt0762108,I'll Be There with You,2006,Thriller,USA,128.0,7.0
1,tt2044077,Wo kou de zong ji,2011,Action,China,525.0,5.5
2,tt3846718,Mesuvag Harig,2015,"Comedy, Horror",Israel,238.0,5.4
3,tt0048078,Five Guns West,1955,Western,USA,677.0,4.8
4,tt0022753,Chandu the Magician,1932,"Action, Adventure, Comedy",USA,869.0,6.4
...,...,...,...,...,...,...,...
40631,tt0052711,"Crime & Punishment, USA",1959,Drama,USA,149.0,6.1
40632,tt0315431,Constellation,2005,Drama,USA,538.0,4.7
40633,tt3006156,Tteu-geoun ann-yeong,2013,"Comedy, Drama",South Korea,191.0,7.1
40634,tt0068416,Cosa avete fatto a Solange?,1972,"Horror, Mystery, Thriller","Italy, West Germany, UK",4291.0,7.0
40635,tt6359956,A Bad Moms Christmas,2017,Comedy,"USA, China",40110.0,5.7

In [43]:
#--------------Exclusive Left Join (result of the left join but without common values to both , belongs only to left)--------------------------

# when in an exclusive join always how parameter is outer
df1.merge(df2,on='id',how='outer',indicator=True).query("_merge=='left_only'")

  id   age  job     _merge
0  A  21.0  NaN  left_only
1  B  22.0  NaN  left_only

In [57]:
# make a copy of df_movies
df_movies_2 = df_movies.copy()

In [58]:
# set the first 1000 values of 'imdb_title_id' column as 'tt1234567890'
for index in df_movies_2.index:
    if index<1000:
        df_movies_2.loc[index,'imdb_title_id'] = 'tt1234567890'

In [59]:
# merge df_movies_2  and df_ratings (exclusive _left join)
df_exclusive_left = df_movies_2.merge(df_ratings,on='imdb_title_id',how='outer',indicator=True).query("_merge=='left_only'")

In [60]:
# shape
print(df_exclusive_left.shape)
print(df_movies_2.shape)
print(df_ratings.shape)

(1841, 8)
(81273, 5)
(85855, 3)

In [47]:
df_movies.merge(df_ratings,on='imdb_title_id',how='outer',indicator=True).query("_merge=='left_only'")

,imdb_title_id,title,year,genre,country,total_votes,mean_vote,_merge
28,tt0003952,Le faux magistrat,1914.0,"Crime, Drama",France,NaN,NaN,left_only
192,tt0011131,Dr. Jekyll and Mr. Hyde,1920.0,"Drama, Horror, Sci-Fi",USA,NaN,NaN,left_only
215,tt0011565,The Penalty,1920.0,"Crime, Drama, Horror",USA,NaN,NaN,left_only
287,tt0013086,"Dr. Mabuse, der Spieler",1922.0,"Crime, Mystery, Thriller",Germany,NaN,NaN,left_only
315,tt0013626,La souriante Madame Beudet,1923.0,Drama,France,NaN,NaN,left_only
...,...,...,...,...,...,...,...,...
85784,tt8963708,And Then We Danced,2019.0,"Drama, Romance","Sweden, Georgia, France",NaN,NaN,left_only
85877,tt9026184,Girl on the Third Floor,2019.0,Horror,USA,NaN,NaN,left_only
86047,tt9154566,A Christmas Switch,2018.0,"Comedy, Drama, Family",USA,NaN,NaN,left_only
86081,tt9177040,Trick,2019.0,Horror,USA,NaN,NaN,left_only
86357,tt9495224,Black Mirror: Bandersnatch,2018.0,"Drama, Mystery, Sci-Fi","USA, UK",NaN,NaN,left_only